_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 26, 26, 64)        640       
_________________________________________________________________
activation_1 (Activation)    (None, 26, 26, 64)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 24, 24, 16)        9232      
_________________________________________________________________
batch_normalization_1 (Batch (None, 24, 24, 16)        64        
_________________________________________________________________
activation_2 (Activation)    (None, 24, 24, 16)        0         
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 12, 12, 16)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 10, 12, 16)        784       
_________________________________________________________________
activation_3 (Activation)    (None, 10, 12, 16)        0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 10, 10, 16)        784       
_________________________________________________________________
activation_4 (Activation)    (None, 10, 10, 16)        0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 8, 8, 16)          2320      
_________________________________________________________________
batch_normalization_2 (Batch (None, 8, 8, 16)          64        
_________________________________________________________________
activation_5 (Activation)    (None, 8, 8, 16)          0         
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 6, 6, 16)          2320      
_________________________________________________________________
activation_6 (Activation)    (None, 6, 6, 16)          0         
_________________________________________________________________
average_pooling2d_1 (Average (None, 3, 3, 16)          0         
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 1, 1, 10)          1450      
_________________________________________________________________
batch_normalization_3 (Batch (None, 1, 1, 10)          40        
_________________________________________________________________
activation_7 (Activation)    (None, 1, 1, 10)          0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 10)                0         
_________________________________________________________________
activation_8 (Activation)    (None, 10)                0         
=================================================================
Total params: 17,698
Trainable params: 17,614
Non-trainable params: 84
_________________________________________________________________
Prediction : [[2.0390014e-06 2.0390014e-06 9.9998081e-01 2.0390014e-06 2.0390014e-06
  2.0390014e-06 2.9904345e-06 2.0390014e-06 2.0390014e-06 2.0390014e-06]]
The predicted digit is:  2
Time for prediction: 0.1311398429999997
Running prediction for below image
